SET GLOBAL max_allowed_packet=1073741824;
SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for cities
-- ----------------------------
DROP TABLE IF EXISTS `cities`;
CREATE TABLE `cities` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`province_id`  int(11) NOT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`province_id`) REFERENCES `provinces` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
INDEX `province_id` (`province_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=1180

;

-- ----------------------------
-- Records of cities
-- ----------------------------
BEGIN;
INSERT INTO `cities` VALUES ('1', 'آبش احمد', '1'), ('2', 'آذرشهر', '1'), ('3', 'آقکند', '1'), ('4', 'اچاچی', '1'), ('5', 'اسکو', '1'), ('6', 'اهر', '1'), ('7', 'ایلخچی', '1'), ('8', 'باسمنج', '1'), ('9', 'بخشایش', '1'), ('10', 'بستان آباد', '1'), ('11', 'بناب', '1'), ('12', 'بناب مرند', '1'), ('13', 'تبریز', '1'), ('14', 'ترک', '1'), ('15', 'ترکمانچای', '1'), ('16', 'تسوج', '1'), ('17', 'تیکمه داش', '1'), ('18', 'تیمورلو', '1'), ('19', 'جلفا', '1'), ('20', 'جوان قلعه', '1'), ('21', 'خاروانا', '1'), ('22', 'خامنه', '1'), ('23', 'خداجو(خراجو)', '1'), ('24', 'خسروشاه', '1'), ('25', 'خمارلو', '1'), ('26', 'خواجه', '1'), ('27', 'دوزدوزان', '1'), ('28', 'زرنق', '1'), ('29', 'زنوز', '1'), ('30', 'سراب', '1'), ('31', 'سردرود', '1'), ('32', 'سهند', '1'), ('33', 'سیس', '1'), ('34', 'سیه رود', '1'), ('35', 'شبستر', '1'), ('36', 'شربیان', '1'), ('37', 'شرفخانه', '1'), ('38', 'شندآباد', '1'), ('39', 'صوفیان', '1'), ('40', 'عجب شیر', '1'), ('41', 'قره آغاج', '1'), ('42', 'کشکسرای', '1'), ('43', 'کلوانق', '1'), ('44', 'کلیبر', '1'), ('45', 'کوزه کنان', '1'), ('46', 'گوگان', '1'), ('47', 'لیلان', '1'), ('48', 'مبارک شهر', '1'), ('49', 'مراغه', '1'), ('50', 'مرند', '1'), ('51', 'ملکان', '1'), ('52', 'ممقان', '1'), ('53', 'مهربان', '1'), ('54', 'میانه', '1'), ('55', 'نظرکهریزی', '1'), ('56', 'وایقان', '1'), ('57', 'ورزقان', '1'), ('58', 'هادیشهر', '1'), ('59', 'هریس', '1'), ('60', 'هشترود', '1'), ('61', 'هوراند', '1'), ('62', 'یامچی', '1'), ('63', 'آواجیق', '2'), ('64', 'ارومیه', '2'), ('65', 'اشنویه', '2'), ('66', 'ایواوغلی', '2'), ('67', 'باروق', '2'), ('68', 'بازرگان', '2'), ('69', 'بوکان', '2'), ('70', 'پلدشت', '2'), ('71', 'پیرانشهر', '2'), ('72', 'تازه شهر', '2'), ('73', 'تکاب', '2'), ('74', 'چهاربرج', '2'), ('75', 'خلیفان', '2'), ('76', 'خوی', '2'), ('77', 'دیزج دیز', '2'), ('78', 'ربط', '2'), ('79', 'زرآباد', '2'), ('80', 'سردشت', '2'), ('81', 'سرو', '2'), ('82', 'سلماس', '2'), ('83', 'سیلوانه', '2'), ('84', 'سیمینه', '2'), ('85', 'سیه چشمه', '2'), ('86', 'شاهین دژ', '2'), ('87', 'شوط', '2'), ('88', 'فیرورق', '2'), ('89', 'قره ضیاءالدین', '2'), ('90', 'قطور', '2'), ('91', 'قوشچی', '2'), ('92', 'کشاورز', '2'), ('93', 'گردکشانه', '2'), ('94', 'ماکو', '2'), ('95', 'محمدیار', '2'), ('96', 'محمودآباد', '2'), ('97', 'مرگنلر', '2'), ('98', 'مهاباد', '2'), ('99', 'میاندوآب', '2'), ('100', 'میرآباد', '2');
INSERT INTO `cities` VALUES ('101', 'نازک علیا', '2'), ('102', 'نالوس', '2'), ('103', 'نقده', '2'), ('104', 'نوشین', '2'), ('105', 'آبی بیگلو', '3'), ('106', 'اردبیل', '3'), ('107', 'اسلام اباد', '3'), ('108', 'اصلاندوز', '3'), ('109', 'بیله سوار', '3'), ('110', 'پارس آباد', '3'), ('111', 'تازه کند', '3'), ('112', 'تازه کندانگوت', '3'), ('113', 'جعفرآباد', '3'), ('114', 'خلخال', '3'), ('115', 'رضی', '3'), ('116', 'سرعین', '3'), ('117', 'عنبران', '3'), ('118', 'فخراباد', '3'), ('119', 'قصابه', '3'), ('120', 'کلور', '3'), ('121', 'کوراییم', '3'), ('122', 'گرمی', '3'), ('123', 'گیوی', '3'), ('124', 'لاهرود', '3'), ('125', 'مرادلو', '3'), ('126', 'مشگین شهر', '3'), ('127', 'نمین', '3'), ('128', 'نیر', '3'), ('129', 'هشتجین', '3'), ('130', 'هیر', '3'), ('131', 'آران وبیدگل', '4'), ('132', 'ابوزیدآباد', '4'), ('133', 'اردستان', '4'), ('134', 'اژیه', '4'), ('135', 'اصغرآباد', '4'), ('136', 'انارک', '4'), ('137', 'ایمانشهر', '4'), ('138', 'بادرود', '4'), ('139', 'بافران', '4'), ('140', 'برزک', '4'), ('141', 'برف انبار', '4'), ('142', 'بویین ومیاندشت', '4'), ('143', 'بهاران شهر', '4'), ('144', 'بهارستان', '4'), ('145', 'پیربکران', '4'), ('146', 'تودشک', '4'), ('147', 'تیران', '4'), ('148', 'جوشقان قالی', '4'), ('149', 'چرمهین', '4'), ('150', 'چمگردان', '4'), ('151', 'حبیب آباد', '4'), ('152', 'حسن اباد', '4'), ('153', 'حنا', '4'), ('154', 'خالدآباد', '4'), ('155', 'خوانسار', '4'), ('156', 'خور', '4'), ('157', 'خورزوق', '4'), ('158', 'داران', '4'), ('159', 'درچه', '4'), ('160', 'دولت آباد', '4'), ('161', 'دهاقان', '4'), ('162', 'دهق', '4'), ('163', 'دیزیچه', '4'), ('164', 'رزوه', '4'), ('165', 'رضوانشهر', '4'), ('166', 'زاینده رود', '4'), ('167', 'زرین شهر', '4'), ('168', 'زواره', '4'), ('169', 'زیار', '4'), ('170', 'سجزی', '4'), ('171', 'سده لنجان', '4'), ('172', 'سفیدشهر', '4'), ('173', 'سمیرم', '4'), ('174', 'شاهین شهر', '4'), ('175', 'شهرضا', '4'), ('176', 'طرق رود', '4'), ('177', 'عسگران', '4'), ('178', 'علویجه', '4'), ('179', 'فرخی', '4'), ('180', 'فریدونشهر', '4'), ('181', 'فولادشهر', '4'), ('182', 'قهجاورستان', '4'), ('183', 'قهدریجان', '4'), ('184', 'کاشان', '4'), ('185', 'کرکوند', '4'), ('186', 'کلیشادوسودرجان', '4'), ('187', 'کمشچه', '4'), ('188', 'کوهپایه', '4'), ('189', 'کهریزسنگ', '4'), ('190', 'گرگاب', '4'), ('191', 'گزبرخوار', '4'), ('192', 'گلپایگان', '4'), ('193', 'گلدشت', '4'), ('194', 'گلشن', '4'), ('195', 'گلشهر', '4'), ('196', 'گوگد', '4'), ('197', 'لای بید', '4'), ('198', 'مجلسی', '4'), ('199', 'مشکات', '4'), ('200', 'منظریه', '4');
INSERT INTO `cities` VALUES ('201', 'میمه', '4'), ('202', 'نجف آباد', '4'), ('203', 'نصرآباد', '4'), ('204', 'نیک آباد', '4'), ('205', 'ونک', '4'), ('206', 'هرند', '4'), ('207', 'آسارا', '5'), ('208', 'اشتهارد', '5'), ('209', 'تنکمان', '5'), ('210', 'چهارباغ', '5'), ('211', 'شهرجدیدهشتگرد', '5'), ('212', 'طالقان', '5'), ('213', 'فردیس', '5'), ('214', 'کرج', '5'), ('215', 'کمال شهر', '5'), ('216', 'کوهسار', '5'), ('217', 'گرمدره', '5'), ('218', 'گلسار', '5'), ('219', 'ماهدشت', '5'), ('220', 'محمدشهر', '5'), ('221', 'مشکین دشت', '5'), ('222', 'نظرآباد', '5'), ('223', 'هشتگرد', '5'), ('224', 'آبدانان', '6'), ('225', 'آسمان آباد', '6'), ('226', 'ایلام', '6'), ('227', 'ایوان', '6'), ('228', 'بدره', '6'), ('229', 'بلاوه', '6'), ('230', 'پهله', '6'), ('231', 'سراب باغ', '6'), ('232', 'شباب', '6'), ('233', 'موسیان', '6'), ('234', 'مهر', '6'), ('235', 'مهران', '6'), ('236', 'آب پخش', '7'), ('237', 'آباد', '7'), ('238', 'آبدان', '7'), ('239', 'امام حسن', '7'), ('240', 'انارستان', '7'), ('241', 'اهرم', '7'), ('242', 'بادوله', '7'), ('243', 'برازجان', '7'), ('244', 'بردخون', '7'), ('245', 'بردستان', '7'), ('246', 'بندردیر', '7'), ('247', 'بندردیلم', '7'), ('248', 'بندرریگ', '7'), ('249', 'بندرکنگان', '7'), ('250', 'بندرگناوه', '7'), ('251', 'بنک', '7'), ('252', 'بوشکان', '7'), ('253', 'بوشهر', '7'), ('254', 'تنگ ارم', '7'), ('255', 'جم', '7'), ('256', 'چغادک', '7'), ('257', 'خارک', '7'), ('258', 'خورموج', '7'), ('259', 'دالکی', '7'), ('260', 'دلوار', '7'), ('261', 'دوراهک', '7'), ('262', 'ریز', '7'), ('263', 'سعد آباد', '7'), ('264', 'سیراف', '7'), ('265', 'شبانکاره', '7'), ('266', 'شنبه', '7'), ('267', 'عسلویه', '7'), ('268', 'کاکی', '7'), ('269', 'کلمه', '7'), ('270', 'نخل تقی', '7'), ('271', 'وحدتیه', '7'), ('272', 'آبسرد', '8'), ('273', 'آبعلی', '8'), ('274', 'احمد آباد مستوفی', '8'), ('275', 'ارجمند', '8'), ('276', 'اسلامشهر', '8'), ('277', 'اندیشه', '8'), ('278', 'باغستان', '8'), ('279', 'باقرشهر', '8'), ('280', 'بومهن', '8'), ('281', 'پاکدشت', '8'), ('282', 'پردیس', '8'), ('283', 'پرند', '8'), ('284', 'پیشوا', '8'), ('285', 'تجریش', '8'), ('286', 'تهران', '8'), ('287', 'جوادآباد', '8'), ('288', 'چهاردانگه', '8'), ('289', 'حسن آباد', '8'), ('290', 'دماوند', '8'), ('291', 'رباطکریم', '8'), ('292', 'رودهن', '8'), ('293', 'ری', '8'), ('294', 'شاهدشهر', '8'), ('295', 'شریف آباد', '8'), ('296', 'شمشک', '8'), ('297', 'شهریار', '8'), ('298', 'صالحیه', '8'), ('299', 'صباشهر', '8'), ('300', 'صفادشت', '8');
INSERT INTO `cities` VALUES ('301', 'فردوسیه', '8'), ('302', 'فرون اباد', '8'), ('303', 'فشم', '8'), ('304', 'فیروزکوه', '8'), ('305', 'قدس', '8'), ('306', 'قرچک', '8'), ('307', 'کهریزک', '8'), ('308', 'کیلان', '8'), ('309', 'گلستان', '8'), ('310', 'لواسان', '8'), ('311', 'ملارد', '8'), ('312', 'نسیم شهر', '8'), ('313', 'نصیرشهر', '8'), ('314', 'وحیدیه', '8'), ('315', 'ورامین', '8'), ('316', 'باباحیدر', '9'), ('317', 'بازفت', '9'), ('318', 'بروجن', '9'), ('319', 'پردنجان', '9'), ('320', 'دستنا', '9'), ('321', 'سامان', '9'), ('322', 'سرخون', '9'), ('323', 'سودجان', '9'), ('324', 'سورشجان', '9'), ('325', 'شهرکرد', '9'), ('326', 'صمصامی', '9'), ('327', 'طاقانک', '9'), ('328', 'فرخ شهر', '9'), ('329', 'کاج', '9'), ('330', 'گوجان', '9'), ('331', 'گهرو', '9'), ('332', 'لردگان', '9'), ('333', 'منج', '9'), ('334', 'نقنه', '9'), ('335', 'وردنجان', '9'), ('336', 'هفشجان', '9'), ('337', 'آرین شهر', '10'), ('338', 'آیسک', '10'), ('339', 'ارسک', '10'), ('340', 'اسدیه', '10'), ('341', 'اسفدن', '10'), ('342', 'اسلامیه', '10'), ('343', 'بشرویه', '10'), ('344', 'بیرجند', '10'), ('345', 'حاجی آباد', '10'), ('346', 'خضری دشت بیاض', '10'), ('347', 'خوسف', '10'), ('348', 'دیهوک', '10'), ('349', 'زهان', '10'), ('350', 'سرایان', '10'), ('351', 'سربیشه', '10'), ('352', 'سه قلعه', '10'), ('353', 'شوسف', '10'), ('354', 'طبس', '10'), ('355', 'طبس مسینا', '10'), ('356', 'عشق آباد', '10'), ('357', 'فردوس', '10'), ('358', 'قاین', '10'), ('359', 'قهستان', '10'), ('360', 'گزیک', '10'), ('361', 'محمدشهر', '10'), ('362', 'مود', '10'), ('363', 'نهبندان', '10'), ('364', 'نیمبلوک', '10'), ('365', 'احمدابادصولت', '11'), ('366', 'انابد', '11'), ('367', 'باجگیران', '11'), ('368', 'باخرز', '11'), ('369', 'بار', '11'), ('370', 'بایک', '11'), ('371', 'بجستان', '11'), ('372', 'بردسکن', '11'), ('373', 'بیدخت', '11'), ('374', 'تایباد', '11'), ('375', 'تربت جام', '11'), ('376', 'تربت حیدریه', '11'), ('377', 'جغتای', '11'), ('378', 'جنگل', '11'), ('379', 'چاپشلو', '11'), ('380', 'چکنه', '11'), ('381', 'چناران', '11'), ('382', 'خرو', '11'), ('383', 'خلیل آباد', '11'), ('384', 'خواف', '11'), ('385', 'داورزن', '11'), ('386', 'درگز', '11'), ('387', 'درود', '11'), ('388', 'دولت آباد', '11'), ('389', 'رباط سنگ', '11'), ('390', 'رشتخوار', '11'), ('391', 'رضویه', '11'), ('392', 'روداب', '11'), ('393', 'ریوش', '11'), ('394', 'سبزوار', '11'), ('395', 'سرخس', '11'), ('396', 'سفیدسنگ', '11'), ('397', 'سلامی', '11'), ('398', 'سلطان آباد', '11'), ('399', 'سنگان', '11'), ('400', 'شادمهر', '11');
INSERT INTO `cities` VALUES ('401', 'شاندیز', '11'), ('402', 'ششتمد', '11'), ('403', 'شهراباد', '11'), ('404', 'شهرزو', '11'), ('405', 'صالح آباد', '11'), ('406', 'طرقبه', '11'), ('407', 'عشق آباد', '11'), ('408', 'فرهادگرد', '11'), ('409', 'فریمان', '11'), ('410', 'فیروزه', '11'), ('411', 'فیض آباد', '11'), ('412', 'قاسم آباد', '11'), ('413', 'قدمگاه', '11'), ('414', 'قلندرآباد', '11'), ('415', 'قوچان', '11'), ('416', 'کاخک', '11'), ('417', 'کاریز', '11'), ('418', 'کاشمر', '11'), ('419', 'کدکن', '11'), ('420', 'کلات', '11'), ('421', 'کندر', '11'), ('422', 'گلمکان', '11'), ('423', 'گناباد', '11'), ('424', 'لطف آباد', '11'), ('425', 'مزدآوند', '11'), ('426', 'مشهد', '11'), ('427', 'مشهدریزه', '11'), ('428', 'ملک آباد', '11'), ('429', 'نشتیفان', '11'), ('430', 'نصرآباد', '11'), ('431', 'نقاب', '11'), ('432', 'نوخندان', '11'), ('433', 'نیشابور', '11'), ('434', 'نیل شهر', '11'), ('435', 'همت آباد', '11'), ('436', 'یونسی', '11'), ('437', 'آشخانه', '12'), ('438', 'آوا', '12'), ('439', 'اسفراین', '12'), ('440', 'ایور', '12'), ('441', 'بجنورد', '12'), ('442', 'پیش قلعه', '12'), ('443', 'تیتکانلو', '12'), ('444', 'جاجرم', '12'), ('445', 'چناران شهر', '12'), ('446', 'حصارگرمخان', '12'), ('447', 'درق', '12'), ('448', 'راز', '12'), ('449', 'زیارت', '12'), ('450', 'سنخواست', '12'), ('451', 'شوقان', '12'), ('452', 'شیروان', '12'), ('453', 'صفی آباد', '12'), ('454', 'فاروج', '12'), ('455', 'قاضی', '12'), ('456', 'قوشخانه', '12'), ('457', 'گرمه', '12'), ('458', 'لوجلی', '12'), ('459', 'آبادان', '13'), ('460', 'آبژدان', '13'), ('461', 'آزادی', '13'), ('462', 'آغاجاری', '13'), ('463', 'ابوحمیظه', '13'), ('464', 'اروندکنار', '13'), ('465', 'الوان', '13'), ('466', 'الهایی', '13'), ('467', 'امیدیه', '13'), ('468', 'اندیمشک', '13'), ('469', 'اهواز', '13'), ('470', 'ایذه', '13'), ('471', 'باغ ملک', '13'), ('472', 'بستان', '13'), ('473', 'بندرامام خمینی', '13'), ('474', 'بندرماهشهر', '13'), ('475', 'بهبهان', '13'), ('476', 'بیدروبه', '13'), ('477', 'ترکالکی', '13'), ('478', 'تشان', '13'), ('479', 'جایزان', '13'), ('480', 'جنت مکان', '13'), ('481', 'چغامیش', '13'), ('482', 'چم گلک', '13'), ('483', 'چمران', '13'), ('484', 'چویبده', '13'), ('485', 'حر', '13'), ('486', 'حسینیه', '13'), ('487', 'حمزه', '13'), ('488', 'حمیدیه', '13'), ('489', 'خرمشهر', '13'), ('490', 'خنافره', '13'), ('491', 'دارخوین', '13'), ('492', 'دزفول', '13'), ('493', 'دهدز', '13'), ('494', 'رامشیر', '13'), ('495', 'رامهرمز', '13'), ('496', 'رفیع', '13'), ('497', 'زهره', '13'), ('498', 'سالند', '13'), ('499', 'سرداران', '13'), ('500', 'سردشت', '13');
INSERT INTO `cities` VALUES ('501', 'سماله', '13'), ('502', 'سوسنگرد', '13'), ('503', 'سیاه منصور', '13'), ('504', 'شادگان', '13'), ('505', 'شاوور', '13'), ('506', 'شرافت', '13'), ('507', 'شمس آباد', '13'), ('508', 'شوش', '13'), ('509', 'شوشتر', '13'), ('510', 'شهر امام', '13'), ('511', 'شیبان', '13'), ('512', 'صالح شهر', '13'), ('513', 'صفی آباد', '13'), ('514', 'صیدون', '13'), ('515', 'فتح المبین', '13'), ('516', 'قلعه تل', '13'), ('517', 'قلعه خواجه', '13'), ('518', 'کوت سیدنعیم', '13'), ('519', 'کوت عبداله', '13'), ('520', 'گتوند', '13'), ('521', 'گلگیر', '13'), ('522', 'گوریه', '13'), ('523', 'لالی', '13'), ('524', 'مسجدسلیمان', '13'), ('525', 'مشراگه', '13'), ('526', 'مقاومت', '13'), ('527', 'ملاثانی', '13'), ('528', 'منصوریه', '13'), ('529', 'میانرود', '13'), ('530', 'میداود', '13'), ('531', 'مینوشهر', '13'), ('532', 'ویس', '13'), ('533', 'هفتگل', '13'), ('534', 'هندیجان', '13'), ('535', 'هویزه', '13'), ('536', 'آب بر', '14'), ('537', 'ابهر', '14'), ('538', 'ارمغانخانه', '14'), ('539', 'چورزق', '14'), ('540', 'حلب', '14'), ('541', 'خرمدره', '14'), ('542', 'دندی', '14'), ('543', 'زرین آباد', '14'), ('544', 'زرین رود', '14'), ('545', 'زنجان', '14'), ('546', 'سجاس', '14'), ('547', 'سلطانیه', '14'), ('548', 'سهرورد', '14'), ('549', 'صایین قلعه', '14'), ('550', 'قیدار', '14'), ('551', 'کرسف', '14'), ('552', 'گرماب', '14'), ('553', 'ماه نشان', '14'), ('554', 'نوربهار', '14'), ('555', 'نیک پی', '14'), ('556', 'هیدج', '14'), ('557', 'آرادان', '15'), ('558', 'امیریه', '15'), ('559', 'ایوانکی', '15'), ('560', 'بسطام', '15'), ('561', 'بیارجمند', '15'), ('562', 'دامغان', '15'), ('563', 'درجزین', '15'), ('564', 'دیباج', '15'), ('565', 'رودیان', '15'), ('566', 'سرخه', '15'), ('567', 'سمنان', '15'), ('568', 'شاهرود', '15'), ('569', 'شهمیرزاد', '15'), ('570', 'کلاته', '15'), ('571', 'کلاته خیج', '15'), ('572', 'کهن آباد', '15'), ('573', 'گرمسار', '15'), ('574', 'مجن', '15'), ('575', 'مهدی شهر', '15'), ('576', 'میامی', '15'), ('577', 'ادیمی', '16'), ('578', 'اسپکه', '16'), ('579', 'ایرانشهر', '16'), ('580', 'بزمان', '16'), ('581', 'بمپور', '16'), ('582', 'بنت', '16'), ('583', 'بنجار', '16'), ('584', 'پیشین', '16'), ('585', 'جالق', '16'), ('586', 'چاه بهار', '16'), ('587', 'خاش', '16'), ('588', 'دوست محمد', '16'), ('589', 'راسک', '16'), ('590', 'زابل', '16'), ('591', 'زابلی', '16'), ('592', 'زاهدان', '16'), ('593', 'زرآباد', '16'), ('594', 'زهک', '16'), ('595', 'سراوان', '16'), ('596', 'سرباز', '16'), ('597', 'سوران', '16'), ('598', 'سیرکان', '16'), ('599', 'شهرک علی اکبر', '16'), ('600', 'فنوج', '16');
INSERT INTO `cities` VALUES ('601', 'قصرقند', '16'), ('602', 'کنارک', '16'), ('603', 'گشت', '16'), ('604', 'گلمورتی', '16'), ('605', 'محمدآباد', '16'), ('606', 'محمدان', '16'), ('607', 'محمدی', '16'), ('608', 'میرجاوه', '16'), ('609', 'نصرت آباد', '16'), ('610', 'نگور', '16'), ('611', 'نوک آباد', '16'), ('612', 'نیک شهر', '16'), ('613', 'هیدوچ', '16'), ('614', 'آباده', '17'), ('615', 'آباده طشک', '17'), ('616', 'اردکان', '17'), ('617', 'ارسنجان', '17'), ('618', 'استهبان', '17'), ('619', 'اسیر', '17'), ('620', 'اشکنان', '17'), ('621', 'افزر', '17'), ('622', 'اقلید', '17'), ('623', 'امام شهر', '17'), ('624', 'اوز', '17'), ('625', 'اهل', '17'), ('626', 'ایج', '17'), ('627', 'ایزدخواست', '17'), ('628', 'باب انار', '17'), ('629', 'بابامنیر', '17'), ('630', 'بالاده', '17'), ('631', 'بنارویه', '17'), ('632', 'بوانات', '17'), ('633', 'بهمن', '17'), ('634', 'بیرم', '17'), ('635', 'بیضا', '17'), ('636', 'جنت شهر', '17'), ('637', 'جویم', '17'), ('638', 'جهرم', '17'), ('639', 'حاجی آباد', '17'), ('640', 'حسامی', '17'), ('641', 'حسن اباد', '17'), ('642', 'خانه زنیان', '17'), ('643', 'خانیمن', '17'), ('644', 'خاوران', '17'), ('645', 'خرامه', '17'), ('646', 'خشت', '17'), ('647', 'خنج', '17'), ('648', 'خور', '17'), ('649', 'خوزی', '17'), ('650', 'خومه زار', '17'), ('651', 'داراب', '17'), ('652', 'داریان', '17'), ('653', 'دبیران', '17'), ('654', 'دژکرد', '17'), ('655', 'دوبرجی', '17'), ('656', 'دوزه', '17'), ('657', 'دهرم', '17'), ('658', 'رامجرد', '17'), ('659', 'رونیز', '17'), ('660', 'زاهدشهر', '17'), ('661', 'زرقان', '17'), ('662', 'سده', '17'), ('663', 'سروستان', '17'), ('664', 'سعادت شهر', '17'), ('665', 'سلطان شهر', '17'), ('666', 'سورمق', '17'), ('667', 'سیدان', '17'), ('668', 'ششده', '17'), ('669', 'شهرپیر', '17'), ('670', 'شهرصدرا', '17'), ('671', 'شیراز', '17'), ('672', 'صغاد', '17'), ('673', 'صفاشهر', '17'), ('674', 'علامرودشت', '17'), ('675', 'عمادده', '17'), ('676', 'فدامی', '17'), ('677', 'فراشبند', '17'), ('678', 'فسا', '17'), ('679', 'فیروزآباد', '17'), ('680', 'قادراباد', '17'), ('681', 'قایمیه', '17'), ('682', 'قره بلاغ', '17'), ('683', 'قطب آباد', '17'), ('684', 'قطرویه', '17'), ('685', 'قیر', '17'), ('686', 'کارزین (فتح آباد)', '17'), ('687', 'کازرون', '17'), ('688', 'کامفیروز', '17'), ('689', 'کره ای', '17'), ('690', 'کنارتخته', '17'), ('691', 'کوار', '17'), ('692', 'کوپن', '17'), ('693', 'کوهنجان', '17'), ('694', 'گراش', '17'), ('695', 'گله دار', '17'), ('696', 'لار', '17'), ('697', 'لامرد', '17'), ('698', 'لپویی', '17'), ('699', 'لطیفی', '17'), ('700', 'مادرسلیمان', '17');
INSERT INTO `cities` VALUES ('701', 'مبارک آباددیز', '17'), ('702', 'مرودشت', '17'), ('703', 'مزایجان', '17'), ('704', 'مشکان', '17'), ('705', 'مصیری', '17'), ('706', 'مهر', '17'), ('707', 'میانشهر', '17'), ('708', 'میمند', '17'), ('709', 'نوبندگان', '17'), ('710', 'نوجین', '17'), ('711', 'نودان', '17'), ('712', 'نورآباد', '17'), ('713', 'نی ریز', '17'), ('714', 'وراوی', '17'), ('715', 'هماشهر', '17'), ('716', 'آبگرم', '18'), ('717', 'آبیک', '18'), ('718', 'آوج', '18'), ('719', 'ارداق', '18'), ('720', 'اسفرورین', '18'), ('721', 'اقبالیه', '18'), ('722', 'الوند', '18'), ('723', 'بویین زهرا', '18'), ('724', 'بیدستان', '18'), ('725', 'تاکستان', '18'), ('726', 'خاکعلی', '18'), ('727', 'خرمدشت', '18'), ('728', 'دانسفهان', '18'), ('729', 'رازمیان', '18'), ('730', 'سگزآباد', '18'), ('731', 'سیردان', '18'), ('732', 'شال', '18'), ('733', 'شریفیه', '18'), ('734', 'ضیاڈآباد', '18'), ('735', 'قزوین', '18'), ('736', 'کوهین', '18'), ('737', 'محمدیه', '18'), ('738', 'محمودآبادنمونه', '18'), ('739', 'معلم کلایه', '18'), ('740', 'نرجه', '18'), ('741', 'جعفریه', '19'), ('742', 'دستجرد', '19'), ('743', 'سلفچگان', '19'), ('744', 'قم', '19'), ('745', 'قنوات', '19'), ('746', 'کهک', '19'), ('747', 'آرمرده', '20'), ('748', 'اورامان تخت', '20'), ('749', 'بابارشانی', '20'), ('750', 'بانه', '20'), ('751', 'برده رشه', '20'), ('752', 'بلبان آباد', '20'), ('753', 'بویین سفلی', '20'), ('754', 'بیجار', '20'), ('755', 'پیرتاج', '20'), ('756', 'توپ آغاج', '20'), ('757', 'چناره', '20'), ('758', 'دزج', '20'), ('759', 'دلبران', '20'), ('760', 'دهگلان', '20'), ('761', 'دیواندره', '20'), ('762', 'زرینه', '20'), ('763', 'سروآباد', '20'), ('764', 'سریش آباد', '20'), ('765', 'سقز', '20'), ('766', 'سنندج', '20'), ('767', 'شویشه', '20'), ('768', 'صاحب', '20'), ('769', 'قروه', '20'), ('770', 'کامیاران', '20'), ('771', 'کانی دینار', '20'), ('772', 'کانی سور', '20'), ('773', 'مریوان', '20'), ('774', 'موچش', '20'), ('775', 'یاسوکند', '20'), ('776', 'اختیارآباد', '21'), ('777', 'ارزوییه', '21'), ('778', 'امین شهر', '21'), ('779', 'انار', '21'), ('780', 'اندوهجرد', '21'), ('781', 'باغین', '21'), ('782', 'بافت', '21'), ('783', 'بردسیر', '21'), ('784', 'بروات', '21'), ('785', 'بزنجان', '21'), ('786', 'بلورد', '21'), ('787', 'بلوک', '21'), ('788', 'بم', '21'), ('789', 'بهرمان', '21'), ('790', 'پاریز', '21'), ('791', 'جبالبارز', '21'), ('792', 'جوپار', '21'), ('793', 'جوزم', '21'), ('794', 'جیرفت', '21'), ('795', 'چترود', '21'), ('796', 'خاتون اباد', '21'), ('797', 'خانوک', '21'), ('798', 'خواجو شهر', '21'), ('799', 'خورسند', '21'), ('800', 'درب بهشت', '21');
INSERT INTO `cities` VALUES ('801', 'دشتکار', '21'), ('802', 'دوساری', '21'), ('803', 'دهج', '21'), ('804', 'رابر', '21'), ('805', 'راور', '21'), ('806', 'راین', '21'), ('807', 'رفسنجان', '21'), ('808', 'رودبار', '21'), ('809', 'ریحان', '21'), ('810', 'زرند', '21'), ('811', 'زنگی آباد', '21'), ('812', 'زهکلوت', '21'), ('813', 'زیدآباد', '21'), ('814', 'سیرجان', '21'), ('815', 'شهداد', '21'), ('816', 'شهربابک', '21'), ('817', 'صفاییه', '21'), ('818', 'عنبرآباد', '21'), ('819', 'فاریاب', '21'), ('820', 'فهرج', '21'), ('821', 'قلعه گنج', '21'), ('822', 'کاظم آباد', '21'), ('823', 'کرمان', '21'), ('824', 'کشکوییه', '21'), ('825', 'کوهبنان', '21'), ('826', 'کهنوج', '21'), ('827', 'کیانشهر', '21'), ('828', 'گلباف', '21'), ('829', 'گلزار', '21'), ('830', 'گنبکی', '21'), ('831', 'لاله زار', '21'), ('832', 'ماهان', '21'), ('833', 'محمدآباد', '21'), ('834', 'محی آباد', '21'), ('835', 'مردهک', '21'), ('836', 'مس سرچشمه', '21'), ('837', 'منوجان', '21'), ('838', 'نجف شهر', '21'), ('839', 'نرماشیر', '21'), ('840', 'نظام شهر', '21'), ('841', 'نگار', '21'), ('842', 'نودژ', '21'), ('843', 'هجدک', '21'), ('844', 'هماشهر', '21'), ('845', 'هنزا', '21'), ('846', 'یزدان شهر', '21'), ('847', 'ازگله', '22'), ('848', 'اسلام آبادغرب', '22'), ('849', 'بانوره', '22'), ('850', 'باینگان', '22'), ('851', 'بیستون', '22'), ('852', 'پاوه', '22'), ('853', 'تازه آباد', '22'), ('854', 'جوانرود', '22'), ('855', 'حمیل', '22'), ('856', 'رباط', '22'), ('857', 'روانسر', '22'), ('858', 'ریجاب', '22'), ('859', 'سرپل ذهاب', '22'), ('860', 'سرمست', '22'), ('861', 'سطر', '22'), ('862', 'سنقر', '22'), ('863', 'سومار', '22'), ('864', 'شاهو', '22'), ('865', 'صحنه', '22'), ('866', 'قصرشیرین', '22'), ('867', 'کرمانشاه', '22'), ('868', 'کرند', '22'), ('869', 'کنگاور', '22'), ('870', 'کوزران', '22'), ('871', 'گودین', '22'), ('872', 'گهواره', '22'), ('873', 'گیلانغرب', '22'), ('874', 'میان راهان', '22'), ('875', 'نودشه', '22'), ('876', 'نوسود', '22'), ('877', 'هرسین', '22'), ('878', 'هلشی', '22'), ('879', 'باشت', '23'), ('880', 'پاتاوه', '23'), ('881', 'چرام', '23'), ('882', 'چیتاب', '23'), ('883', 'دوگنبدان', '23'), ('884', 'دهدشت', '23'), ('885', 'دیشموک', '23'), ('886', 'سرفاریاب', '23'), ('887', 'سوق', '23'), ('888', 'سی سخت', '23'), ('889', 'قلعه رییسی', '23'), ('890', 'گراب سفلی', '23'), ('891', 'لنده', '23'), ('892', 'لیکک', '23'), ('893', 'مادوان', '23'), ('894', 'مارگون', '23'), ('895', 'یاسوج', '23'), ('896', 'آزادشهر', '24'), ('897', 'آق قلا', '24'), ('898', 'انبارآلوم', '24'), ('899', 'اینچه برون', '24'), ('900', 'بندرترکمن', '24');
INSERT INTO `cities` VALUES ('901', 'بندرگز', '24'), ('902', 'تاتارعلیا', '24'), ('903', 'جلین', '24'), ('904', 'خان ببین', '24'), ('905', 'دلند', '24'), ('906', 'رامیان', '24'), ('907', 'سرخنکلاته', '24'), ('908', 'سنگدوین', '24'), ('909', 'سیمین شهر', '24'), ('910', 'علی اباد', '24'), ('911', 'فاضل آباد', '24'), ('912', 'فراغی', '24'), ('913', 'کردکوی', '24'), ('914', 'کلاله', '24'), ('915', 'گالیکش', '24'), ('916', 'گرگان', '24'), ('917', 'گمیش تپه', '24'), ('918', 'گنبدکاووس', '24'), ('919', 'مراوه', '24'), ('920', 'مزرعه', '24'), ('921', 'مینودشت', '24'), ('922', 'نگین شهر', '24'), ('923', 'نوده خاندوز', '24'), ('924', 'نوکنده', '24'), ('925', 'آستارا', '25'), ('926', 'آستانه اشرفیه', '25'), ('927', 'احمدسرگوراب', '25'), ('928', 'اسالم', '25'), ('929', 'اطاقور', '25'), ('930', 'املش', '25'), ('931', 'بازار جمعه', '25'), ('932', 'بره سر', '25'), ('933', 'بندرانزلی', '25'), ('934', 'پره سر', '25'), ('935', 'توتکابن', '25'), ('936', 'جیرنده', '25'), ('937', 'چابکسر', '25'), ('938', 'چاف و چمخاله', '25'), ('939', 'چوبر', '25'), ('940', 'حویق', '25'), ('941', 'خشکبیجار', '25'), ('942', 'خمام', '25'), ('943', 'دیلمان', '25'), ('944', 'رانکوه', '25'), ('945', 'رحیم آباد', '25'), ('946', 'رستم آباد', '25'), ('947', 'رشت', '25'), ('948', 'رضوانشهر', '25'), ('949', 'رودبار', '25'), ('950', 'رودبنه', '25'), ('951', 'رودسر', '25'), ('952', 'سنگر', '25'), ('953', 'سیاهکل', '25'), ('954', 'شفت', '25'), ('955', 'شلمان', '25'), ('956', 'صومعه سرا', '25'), ('957', 'فومن', '25'), ('958', 'کلاچای', '25'), ('959', 'کوچصفهان', '25'), ('960', 'کومله', '25'), ('961', 'کیاشهر', '25'), ('962', 'گوراب زرمیخ', '25'), ('963', 'لاهیجان', '25'), ('964', 'لشت نشاء', '25'), ('965', 'لنگرود', '25'), ('966', 'لوشان', '25'), ('967', 'لولمان', '25'), ('968', 'لوندویل', '25'), ('969', 'لیسار', '25'), ('970', 'ماسال', '25'), ('971', 'ماسوله', '25'), ('972', 'ماکلوان', '25'), ('973', 'مرجقل', '25'), ('974', 'منجیل', '25'), ('975', 'واجارگاه', '25'), ('976', 'هشتپر (تالش)', '25'), ('977', 'ازنا', '26'), ('978', 'اشترینان', '26'), ('979', 'الشتر', '26'), ('980', 'الیگودرز', '26'), ('981', 'بروجرد', '26'), ('982', 'بیران شهر', '26'), ('983', 'پلدختر', '26'), ('984', 'چالانچولان', '26'), ('985', 'چقابل', '26'), ('986', 'خرم آباد', '26'), ('987', 'درب گنبد', '26'), ('988', 'دورود', '26'), ('989', 'زاغه', '26'), ('990', 'سپیددشت', '26'), ('991', 'سراب دوره', '26'), ('992', 'شول آباد', '26'), ('993', 'فیروزآباد', '26'), ('994', 'کوهدشت', '26'), ('995', 'کوهنانی', '26'), ('996', 'گراب', '26'), ('997', 'معمولان', '26'), ('998', 'مومن آباد', '26'), ('999', 'نورآباد', '26'), ('1000', 'ویسیان', '26');
INSERT INTO `cities` VALUES ('1001', 'هفت چشمه', '26'), ('1002', 'آلاشت', '27'), ('1003', 'آمل', '27'), ('1004', 'ارطه', '27'), ('1005', 'امامزاده عبدالله', '27'), ('1006', 'امیرکلا', '27'), ('1007', 'ایزدشهر', '27'), ('1008', 'بابل', '27'), ('1009', 'بابلسر', '27'), ('1010', 'بلده', '27'), ('1011', 'بهشهر', '27'), ('1012', 'بهنمیر', '27'), ('1013', 'پایین هولار', '27'), ('1014', 'پل سفید', '27'), ('1015', 'پول', '27'), ('1016', 'تنکابن', '27'), ('1017', 'جویبار', '27'), ('1018', 'چالوس', '27'), ('1019', 'چمستان', '27'), ('1020', 'خرم آباد', '27'), ('1021', 'خلیل شهر', '27'), ('1022', 'خوش رودپی', '27'), ('1023', 'دابودشت', '27'), ('1024', 'رامسر', '27'), ('1025', 'رستمکلا', '27'), ('1026', 'رویان', '27'), ('1027', 'رینه', '27'), ('1028', 'زرگرمحله', '27'), ('1029', 'زیرآب', '27'), ('1030', 'ساری', '27'), ('1031', 'سرخرود', '27'), ('1032', 'سلمان شهر', '27'), ('1033', 'سورک', '27'), ('1034', 'شیرگاه', '27'), ('1035', 'شیرود', '27'), ('1036', 'عباس اباد', '27'), ('1037', 'فریدونکنار', '27'), ('1038', 'فریم', '27'), ('1039', 'قایم شهر', '27'), ('1040', 'کتالم وسادات شهر', '27'), ('1041', 'کجور', '27'), ('1042', 'کلارآباد', '27'), ('1043', 'کلاردشت', '27'), ('1044', 'کوهی خیل', '27'), ('1045', 'کیاسر', '27'), ('1046', 'کیاکلا', '27'), ('1047', 'گتاب', '27'), ('1048', 'گزنک', '27'), ('1049', 'گلوگاه', '27'), ('1050', 'محمودآباد', '27'), ('1051', 'مرزن آباد', '27'), ('1052', 'مرزیکلا', '27'), ('1053', 'نشتارود', '27'), ('1054', 'نکا', '27'), ('1055', 'نور', '27'), ('1056', 'نوشهر', '27'), ('1057', 'هادی شهر', '27'), ('1058', 'هچیرود', '27'), ('1059', 'آستانه', '28'), ('1060', 'آشتیان', '28'), ('1061', 'آوه', '28'), ('1062', 'اراک', '28'), ('1063', 'پرندک', '28'), ('1064', 'تفرش', '28'), ('1065', 'توره', '28'), ('1066', 'جاورسیان', '28'), ('1067', 'خشکرود', '28'), ('1068', 'خمین', '28'), ('1069', 'خنجین', '28'), ('1070', 'خنداب', '28'), ('1071', 'داودآباد', '28'), ('1072', 'دلیجان', '28'), ('1073', 'رازقان', '28'), ('1074', 'زاویه', '28'), ('1075', 'ساروق', '28'), ('1076', 'ساوه', '28'), ('1077', 'شازند', '28'), ('1078', 'شهباز', '28'), ('1079', 'غرق آباد', '28'), ('1080', 'فرمهین', '28'), ('1081', 'قورچی باشی', '28'), ('1082', 'کارچان', '28'), ('1083', 'کمیجان', '28'), ('1084', 'مامونیه', '28'), ('1085', 'محلات', '28'), ('1086', 'مهاجران', '28'), ('1087', 'میلاجرد', '28'), ('1088', 'نراق', '28'), ('1089', 'نوبران', '28'), ('1090', 'نیمور', '28'), ('1091', 'هندودر', '28'), ('1092', 'ابوموسی', '29'), ('1093', 'بستک', '29'), ('1094', 'بندرجاسک', '29'), ('1095', 'بندرعباس', '29'), ('1096', 'بندرلنگه', '29'), ('1097', 'بیکاء', '29'), ('1098', 'پارسیان', '29'), ('1099', 'تازیان پایین', '29'), ('1100', 'تخت', '29');
INSERT INTO `cities` VALUES ('1101', 'تیرور', '29'), ('1102', 'جناح', '29'), ('1103', 'چارک', '29'), ('1104', 'حاجی اباد', '29'), ('1105', 'خمیر', '29'), ('1106', 'درگهان', '29'), ('1107', 'دشتی', '29'), ('1108', 'دهبارز', '29'), ('1109', 'رویدر', '29'), ('1110', 'زیارتعلی', '29'), ('1111', 'سردشت', '29'), ('1112', 'سرگز', '29'), ('1113', 'سندرک', '29'), ('1114', 'سوزا', '29'), ('1115', 'سیریک', '29'), ('1116', 'فارغان', '29'), ('1117', 'فین', '29'), ('1118', 'قشم', '29'), ('1119', 'قلعه قاضی', '29'), ('1120', 'کنگ', '29'), ('1121', 'کوشکنار', '29'), ('1122', 'کوهستک', '29'), ('1123', 'کیش', '29'), ('1124', 'گروک', '29'), ('1125', 'گوهران', '29'), ('1126', 'لمزان', '29'), ('1127', 'میناب', '29'), ('1128', 'هرمز', '29'), ('1129', 'هشتبندی', '29'), ('1130', 'آجین', '30'), ('1131', 'ازندریان', '30'), ('1132', 'اسدآباد', '30'), ('1133', 'برزول', '30'), ('1134', 'بهار', '30'), ('1135', 'تویسرکان', '30'), ('1136', 'جورقان', '30'), ('1137', 'جوکار', '30'), ('1138', 'دمق', '30'), ('1139', 'رزن', '30'), ('1140', 'زنگنه', '30'), ('1141', 'سامن', '30'), ('1142', 'سرکان', '30'), ('1143', 'شیرین سو', '30'), ('1144', 'صالح آباد', '30'), ('1145', 'فامنین', '30'), ('1146', 'فرسفج', '30'), ('1147', 'فیروزان', '30'), ('1148', 'قروه درجزین', '30'), ('1149', 'قهاوند', '30'), ('1150', 'کبودرآهنگ', '30'), ('1151', 'گل تپه', '30'), ('1152', 'گیان', '30'), ('1153', 'لالجین', '30'), ('1154', 'مریانج', '30'), ('1155', 'ملایر', '30'), ('1156', 'مهاجران', '30'), ('1157', 'نهاوند', '30'), ('1158', 'همدان', '30'), ('1159', 'ابرکوه', '31'), ('1160', 'احمدآباد', '31'), ('1161', 'اردکان', '31'), ('1162', 'اشکذر', '31'), ('1163', 'بافق', '31'), ('1164', 'بفروییه', '31'), ('1165', 'بهاباد', '31'), ('1166', 'تفت', '31'), ('1167', 'حمیدیا', '31'), ('1168', 'خضرآباد', '31'), ('1169', 'زارچ', '31'), ('1170', 'شاهدیه', '31'), ('1171', 'عقدا', '31'), ('1172', 'مروست', '31'), ('1173', 'مهردشت', '31'), ('1174', 'مهریز', '31'), ('1175', 'میبد', '31'), ('1176', 'ندوشن', '31'), ('1177', 'نیر', '31'), ('1178', 'هرات', '31'), ('1179', 'یزد', '31');
COMMIT;

-- ----------------------------
-- Table structure for games
-- ----------------------------
DROP TABLE IF EXISTS `games`;
CREATE TABLE `games` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`player_1`  int(11) NOT NULL ,
`player_2`  int(11) NULL DEFAULT NULL ,
`type_id`  int(11) NOT NULL ,
`amount`  int(11) NOT NULL ,
`status_id`  int(11) NOT NULL ,
`total_amount`  int(11) NOT NULL ,
`winner_id`  int(11) NULL DEFAULT NULL ,
`loser_id`  int(11) NULL DEFAULT NULL ,
`started_at`  datetime NULL DEFAULT NULL ,
`finished_at`  datetime NULL DEFAULT NULL ,
`datetime`  datetime NOT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`player_1`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`player_2`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`winner_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`loser_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`status_id`) REFERENCES `games_status` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`type_id`) REFERENCES `games_types` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
INDEX `player_1` (`player_1`) USING BTREE ,
INDEX `player_2` (`player_2`) USING BTREE ,
INDEX `winner_id` (`winner_id`) USING BTREE ,
INDEX `loser_id` (`loser_id`) USING BTREE ,
INDEX `status_id` (`status_id`) USING BTREE ,
INDEX `type_id` (`type_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=1

;

-- ----------------------------
-- Records of games
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for games_boards
-- ----------------------------
DROP TABLE IF EXISTS `games_boards`;
CREATE TABLE `games_boards` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`game_id`  int(11) NOT NULL ,
`winner_id`  int(11) NULL DEFAULT NULL ,
`status_id`  int(11) NOT NULL ,
`started_at`  datetime NOT NULL ,
`finished_at`  datetime NOT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`game_id`) REFERENCES `games` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`winner_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`status_id`) REFERENCES `games_boards_status` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
INDEX `game_id` (`game_id`) USING BTREE ,
INDEX `winner_id` (`winner_id`) USING BTREE ,
INDEX `status_id` (`status_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=1

;

-- ----------------------------
-- Records of games_boards
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for games_boards_dices
-- ----------------------------
DROP TABLE IF EXISTS `games_boards_dices`;
CREATE TABLE `games_boards_dices` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`board_id`  int(11) NOT NULL ,
`player_id`  int(11) NOT NULL ,
`roll_1`  int(11) NULL DEFAULT NULL ,
`roll_2`  int(11) NULL DEFAULT NULL ,
`datetime`  datetime NULL DEFAULT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`board_id`) REFERENCES `games_boards` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`player_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
INDEX `board_id` (`board_id`) USING BTREE ,
INDEX `player_id` (`player_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=1

;

-- ----------------------------
-- Records of games_boards_dices
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for games_boards_plays
-- ----------------------------
DROP TABLE IF EXISTS `games_boards_plays`;
CREATE TABLE `games_boards_plays` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`dice_id`  int(11) NOT NULL ,
`from`  int(11) NOT NULL ,
`to`  int(11) NOT NULL ,
`distance`  int(11) NOT NULL ,
`datetime`  datetime NOT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`dice_id`) REFERENCES `games_boards_dices` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
INDEX `dice_id` (`dice_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=1

;

-- ----------------------------
-- Records of games_boards_plays
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for games_boards_status
-- ----------------------------
DROP TABLE IF EXISTS `games_boards_status`;
CREATE TABLE `games_boards_status` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
PRIMARY KEY (`id`)
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=3

;

-- ----------------------------
-- Records of games_boards_status
-- ----------------------------
BEGIN;
INSERT INTO `games_boards_status` VALUES ('1', 'در حال بازی'), ('2', 'پایان بازی');
COMMIT;

-- ----------------------------
-- Table structure for games_status
-- ----------------------------
DROP TABLE IF EXISTS `games_status`;
CREATE TABLE `games_status` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
PRIMARY KEY (`id`)
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=6

;

-- ----------------------------
-- Records of games_status
-- ----------------------------
BEGIN;
INSERT INTO `games_status` VALUES ('1', 'در انتظار حریف'), ('2', 'در حال بازی'), ('3', 'پایان بازی'), ('4', 'لغو شده'), ('5', 'تست');
COMMIT;

-- ----------------------------
-- Table structure for games_types
-- ----------------------------
DROP TABLE IF EXISTS `games_types`;
CREATE TABLE `games_types` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
PRIMARY KEY (`id`)
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=4

;

-- ----------------------------
-- Records of games_types
-- ----------------------------
BEGIN;
INSERT INTO `games_types` VALUES ('1', 'تک دست'), ('2', '3 دست'), ('3', '7 دست');
COMMIT;

-- ----------------------------
-- Table structure for ligs
-- ----------------------------
DROP TABLE IF EXISTS `ligs`;
CREATE TABLE `ligs` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`type_id`  int(11) NOT NULL ,
`start_date`  date NOT NULL ,
`start_time`  time NOT NULL ,
`players_count`  int(11) NOT NULL ,
`amount`  int(11) NOT NULL ,
`total_amount`  int(11) NOT NULL ,
`status_id`  int(11) NOT NULL ,
`datetime`  datetime NOT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`type_id`) REFERENCES `ligs_types` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`status_id`) REFERENCES `ligs_status` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
INDEX `type_id` (`type_id`) USING BTREE ,
INDEX `status_id` (`status_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=1

;

-- ----------------------------
-- Records of ligs
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for ligs_games
-- ----------------------------
DROP TABLE IF EXISTS `ligs_games`;
CREATE TABLE `ligs_games` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`lig_id`  int(11) NOT NULL ,
`status_id`  int(11) NOT NULL ,
`player_1`  int(11) NULL DEFAULT NULL ,
`player_2`  int(11) NULL DEFAULT NULL ,
`winner_id`  int(11) NULL DEFAULT NULL ,
`loser_id`  int(11) NULL DEFAULT NULL ,
`started_at`  datetime NULL DEFAULT NULL ,
`finished_at`  datetime NULL DEFAULT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`player_1`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`player_2`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`status_id`) REFERENCES `ligs_games_status` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`winner_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`loser_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`lig_id`) REFERENCES `ligs` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
INDEX `player_1` (`player_1`) USING BTREE ,
INDEX `player_2` (`player_2`) USING BTREE ,
INDEX `status_id` (`status_id`) USING BTREE ,
INDEX `winner_id` (`winner_id`) USING BTREE ,
INDEX `loser_id` (`loser_id`) USING BTREE ,
INDEX `lig_id` (`lig_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=1

;

-- ----------------------------
-- Records of ligs_games
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for ligs_games_boards
-- ----------------------------
DROP TABLE IF EXISTS `ligs_games_boards`;
CREATE TABLE `ligs_games_boards` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`game_id`  int(11) NOT NULL ,
`winner_id`  int(11) NULL DEFAULT NULL ,
`status_id`  int(11) NOT NULL ,
`started_at`  datetime NOT NULL ,
`finished_at`  datetime NULL DEFAULT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`game_id`) REFERENCES `ligs_games` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`winner_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`status_id`) REFERENCES `ligs_games_borads_status` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
INDEX `game_id` (`game_id`) USING BTREE ,
INDEX `winner_id` (`winner_id`) USING BTREE ,
INDEX `status_id` (`status_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=1

;

-- ----------------------------
-- Records of ligs_games_boards
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for ligs_games_boards_dices
-- ----------------------------
DROP TABLE IF EXISTS `ligs_games_boards_dices`;
CREATE TABLE `ligs_games_boards_dices` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`board_id`  int(11) NOT NULL ,
`player_id`  int(11) NOT NULL ,
`roll_1`  int(11) NOT NULL ,
`roll_2`  int(11) NOT NULL ,
`datetime`  datetime NOT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`board_id`) REFERENCES `ligs_games_boards` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`player_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
INDEX `board_id` (`board_id`) USING BTREE ,
INDEX `player_id` (`player_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=1

;

-- ----------------------------
-- Records of ligs_games_boards_dices
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for ligs_games_boards_plays
-- ----------------------------
DROP TABLE IF EXISTS `ligs_games_boards_plays`;
CREATE TABLE `ligs_games_boards_plays` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`dice_id`  int(11) NOT NULL ,
`from`  int(11) NOT NULL ,
`to`  int(11) NOT NULL ,
`distance`  int(11) NOT NULL ,
`datetime`  datetime NOT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`dice_id`) REFERENCES `ligs_games_boards_dices` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
INDEX `dice_id` (`dice_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=1

;

-- ----------------------------
-- Records of ligs_games_boards_plays
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for ligs_games_borads_status
-- ----------------------------
DROP TABLE IF EXISTS `ligs_games_borads_status`;
CREATE TABLE `ligs_games_borads_status` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
PRIMARY KEY (`id`)
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=3

;

-- ----------------------------
-- Records of ligs_games_borads_status
-- ----------------------------
BEGIN;
INSERT INTO `ligs_games_borads_status` VALUES ('1', 'در حال بازی'), ('2', 'پایان بازی');
COMMIT;

-- ----------------------------
-- Table structure for ligs_games_status
-- ----------------------------
DROP TABLE IF EXISTS `ligs_games_status`;
CREATE TABLE `ligs_games_status` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
PRIMARY KEY (`id`)
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=5

;

-- ----------------------------
-- Records of ligs_games_status
-- ----------------------------
BEGIN;
INSERT INTO `ligs_games_status` VALUES ('1', 'در انتظار حریف'), ('2', 'در انتظار شروع بازی'), ('3', 'در حال بازی'), ('4', 'پایان بازی');
COMMIT;

-- ----------------------------
-- Table structure for ligs_players
-- ----------------------------
DROP TABLE IF EXISTS `ligs_players`;
CREATE TABLE `ligs_players` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`lig_id`  int(11) NOT NULL ,
`player_id`  int(11) NOT NULL ,
`datetime`  datetime NOT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`lig_id`) REFERENCES `ligs` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
FOREIGN KEY (`player_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
UNIQUE INDEX `lig_id_2` (`lig_id`, `player_id`) USING BTREE ,
INDEX `lig_id` (`lig_id`) USING BTREE ,
INDEX `player_id` (`player_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=1

;

-- ----------------------------
-- Records of ligs_players
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for ligs_status
-- ----------------------------
DROP TABLE IF EXISTS `ligs_status`;
CREATE TABLE `ligs_status` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
PRIMARY KEY (`id`)
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=5

;

-- ----------------------------
-- Records of ligs_status
-- ----------------------------
BEGIN;
INSERT INTO `ligs_status` VALUES ('1', 'در انتظار بازیکن'), ('2', 'در انتظار شروع بازی'), ('3', 'در حال بازی'), ('4', 'پایان بازی');
COMMIT;

-- ----------------------------
-- Table structure for ligs_types
-- ----------------------------
DROP TABLE IF EXISTS `ligs_types`;
CREATE TABLE `ligs_types` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
PRIMARY KEY (`id`)
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=4

;

-- ----------------------------
-- Records of ligs_types
-- ----------------------------
BEGIN;
INSERT INTO `ligs_types` VALUES ('1', 'تک دست'), ('2', '3 دست'), ('3', '7 دست');
COMMIT;

-- ----------------------------
-- Table structure for provinces
-- ----------------------------
DROP TABLE IF EXISTS `provinces`;
CREATE TABLE `provinces` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
PRIMARY KEY (`id`)
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=32

;

-- ----------------------------
-- Records of provinces
-- ----------------------------
BEGIN;
INSERT INTO `provinces` VALUES ('1', 'آذربایجان شرقی'), ('2', 'آذربایجان غربی'), ('3', 'اردبیل'), ('4', 'اصفهان'), ('5', 'البرز'), ('6', 'ایلام'), ('7', 'بوشهر'), ('8', 'تهران'), ('9', 'چهار محال و بختیاری'), ('10', 'خراسان جنوبی'), ('11', 'خراسان رضوی'), ('12', 'خراسان شمالی'), ('13', 'خوزستان'), ('14', 'زنجان'), ('15', 'سمنان'), ('16', 'سیستان و بلوچستان'), ('17', 'فارس'), ('18', 'قزوین'), ('19', 'قم'), ('20', 'کردستان'), ('21', 'کرمان'), ('22', 'کرمانشاه'), ('23', 'کهکیلویه و بویراحمد'), ('24', 'گلستان'), ('25', 'گیلان'), ('26', 'لرستان'), ('27', 'مازندران'), ('28', 'مرکزی'), ('29', 'هرمزگان'), ('30', 'همدان'), ('31', 'یزد');
COMMIT;

-- ----------------------------
-- Table structure for settings
-- ----------------------------
DROP TABLE IF EXISTS `settings`;
CREATE TABLE `settings` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`email_server`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`email_port`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`email_username`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`email_password`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`send_email_after_register`  smallint(1) NOT NULL ,
`email_text_after_register`  text CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`site_title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`site_copy_right`  text CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`site_logo`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`site_favicon`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`active_mellat_bank`  smallint(1) NOT NULL ,
`active_zarinpall`  smallint(1) NOT NULL ,
`default_gateway`  smallint(1) NOT NULL ,
`mellat_code`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`mellat_username`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`mellat_password`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`zarinpal_merchant_id`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`game_percent`  int(11) NOT NULL ,
`game_timeout`  int(11) NOT NULL ,
`game_disconnect`  int(11) NOT NULL ,
PRIMARY KEY (`id`)
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=2

;

-- ----------------------------
-- Records of settings
-- ----------------------------
BEGIN;
INSERT INTO `settings` VALUES ('1', 'smtp.gmail.com', '587', '-', '-', '0', '<p>کاربر محترم</p>\r\n\r\n<p>از این که در سایت ما عضو شدید کمال تشکر را از شما داریم</p>\r\n\r\n<p>به استحضار میرسانیم که برای ثبت آگهی ابتدا باید نوع کاربری شما توسط ما ثبت شود</p>\r\n\r\n<p>بعد از ثبت نوع کاربری شما ، ایمیلی حاوی اطلاعات نوع کاربری برای شما ارسال خواهد</p>\r\n\r\n<p>از اینکه ما را به عنوان سایت برتر انتخاب نموده اید از شما متشکریم</p>\r\n\r\n<p><a href=\"http://mehreganhosting.ir/backgammon/\" target=\"_blank\">مشاهده سایت</a></p>\r\n', 'تخته نرد', '© کپی رایت - شرکت مهرگان', 'logonim.png', 'default.jpg', '0', '0', '1', '0', '0', '0', '-', '10', '20000', '60000');
COMMIT;

-- ----------------------------
-- Table structure for users
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`username`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`auth_key`  varchar(32) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`password_hash`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`password_reset_token`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NULL DEFAULT NULL ,
`email`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`group_id`  int(11) NOT NULL ,
`status_id`  int(11) NOT NULL ,
`created_at`  datetime NOT NULL ,
`updated_at`  datetime NOT NULL ,
`fullname`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`avatar`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
`credit`  int(11) NOT NULL DEFAULT 0 ,
`address`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NULL DEFAULT NULL ,
`phone`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NULL DEFAULT NULL ,
`mobile`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NULL DEFAULT NULL ,
`province_id`  int(11) NULL DEFAULT NULL ,
`city_id`  int(11) NULL DEFAULT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`group_id`) REFERENCES `users_groups` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
FOREIGN KEY (`status_id`) REFERENCES `users_status` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
FOREIGN KEY (`province_id`) REFERENCES `provinces` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
FOREIGN KEY (`city_id`) REFERENCES `cities` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
INDEX `status_id` (`status_id`) USING BTREE ,
INDEX `province_id` (`province_id`) USING BTREE ,
INDEX `city_id` (`city_id`) USING BTREE ,
INDEX `group_id` (`group_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=2

;

-- ----------------------------
-- Records of users
-- ----------------------------
BEGIN;
INSERT INTO `users` VALUES ('1', 'superadmin', 'qdOpoiNMCsmWkJKblSojmyJSArLltTpH', '$2y$13$p6Mt2W2Reokms4/pwPPsd.LzTkRywVFAJe.T0EcN3ZmjdXAeo2KHO', null, 'hnajafi1994@gmail.com', '1', '1', '2017-08-24 13:52:26', '2017-08-24 13:52:26', 'حسین نجفی', 'default.png', '0', 'بلوار طبرسی شمالی 24 رجب زاده 5 پلاک 4 طبقه 1+', '05132146190', '09357405114', '11', '426');
COMMIT;

-- ----------------------------
-- Table structure for users_followers
-- ----------------------------
DROP TABLE IF EXISTS `users_followers`;
CREATE TABLE `users_followers` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`follower_id`  int(11) NOT NULL ,
`follow_up_id`  int(11) NOT NULL ,
`datetime`  datetime NOT NULL ,
PRIMARY KEY (`id`),
FOREIGN KEY (`follower_id`) REFERENCES `users` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
FOREIGN KEY (`follow_up_id`) REFERENCES `users` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
INDEX `follower_id` (`follower_id`) USING BTREE ,
INDEX `follow_up_id` (`follow_up_id`) USING BTREE 
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=1

;

-- ----------------------------
-- Records of users_followers
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for users_groups
-- ----------------------------
DROP TABLE IF EXISTS `users_groups`;
CREATE TABLE `users_groups` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
PRIMARY KEY (`id`)
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=5

;

-- ----------------------------
-- Records of users_groups
-- ----------------------------
BEGIN;
INSERT INTO `users_groups` VALUES ('1', 'مدیر ارشد'), ('2', 'مدیر سایت'), ('3', 'مدیر'), ('4', 'کاربر');
COMMIT;

-- ----------------------------
-- Table structure for users_status
-- ----------------------------
DROP TABLE IF EXISTS `users_status`;
CREATE TABLE `users_status` (
`id`  int(11) NOT NULL AUTO_INCREMENT ,
`title`  varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL ,
PRIMARY KEY (`id`)
)
ENGINE=InnoDB
DEFAULT CHARACTER SET=utf8 COLLATE=utf8_persian_ci
AUTO_INCREMENT=4

;

-- ----------------------------
-- Records of users_status
-- ----------------------------
BEGIN;
INSERT INTO `users_status` VALUES ('1', 'فعال'), ('2', 'غیر فعال'), ('3', 'حذف');
COMMIT;

-- ----------------------------
-- Function structure for get_count
-- ----------------------------
DROP FUNCTION IF EXISTS `get_count`;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` FUNCTION `get_count`(`in_game_id` integer,`in_user_id` integer) RETURNS int(11)
BEGIN
	RETURN (
		SELECT COUNT(*) 
		FROM games m1 
		INNER JOIN games_boards m2 ON m1.id=m2.game_id 
	  WHERE m1.id = in_game_id AND m2.winner_id = in_user_id
  );
END
;;
DELIMITER ;

-- ----------------------------
-- Function structure for lig_get_count
-- ----------------------------
DROP FUNCTION IF EXISTS `lig_get_count`;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` FUNCTION `lig_get_count`(`in_game_id` integer,`in_user_id` integer) RETURNS int(11)
BEGIN
	RETURN (
		SELECT COUNT(*)
		FROM ligs_games_boards 
		WHERE ligs_games_boards.game_id = in_game_id AND ligs_games_boards.winner_id = in_user_id
  );
END
;;
DELIMITER ;

-- ----------------------------
-- Auto increment value for cities
-- ----------------------------
ALTER TABLE `cities` AUTO_INCREMENT=1180;

-- ----------------------------
-- Auto increment value for games
-- ----------------------------
ALTER TABLE `games` AUTO_INCREMENT=1;

-- ----------------------------
-- Auto increment value for games_boards
-- ----------------------------
ALTER TABLE `games_boards` AUTO_INCREMENT=1;

-- ----------------------------
-- Auto increment value for games_boards_dices
-- ----------------------------
ALTER TABLE `games_boards_dices` AUTO_INCREMENT=1;

-- ----------------------------
-- Auto increment value for games_boards_plays
-- ----------------------------
ALTER TABLE `games_boards_plays` AUTO_INCREMENT=1;

-- ----------------------------
-- Auto increment value for games_boards_status
-- ----------------------------
ALTER TABLE `games_boards_status` AUTO_INCREMENT=3;

-- ----------------------------
-- Auto increment value for games_status
-- ----------------------------
ALTER TABLE `games_status` AUTO_INCREMENT=6;

-- ----------------------------
-- Auto increment value for games_types
-- ----------------------------
ALTER TABLE `games_types` AUTO_INCREMENT=4;

-- ----------------------------
-- Auto increment value for ligs
-- ----------------------------
ALTER TABLE `ligs` AUTO_INCREMENT=1;

-- ----------------------------
-- Auto increment value for ligs_games
-- ----------------------------
ALTER TABLE `ligs_games` AUTO_INCREMENT=1;

-- ----------------------------
-- Auto increment value for ligs_games_boards
-- ----------------------------
ALTER TABLE `ligs_games_boards` AUTO_INCREMENT=1;

-- ----------------------------
-- Auto increment value for ligs_games_boards_dices
-- ----------------------------
ALTER TABLE `ligs_games_boards_dices` AUTO_INCREMENT=1;

-- ----------------------------
-- Auto increment value for ligs_games_boards_plays
-- ----------------------------
ALTER TABLE `ligs_games_boards_plays` AUTO_INCREMENT=1;

-- ----------------------------
-- Auto increment value for ligs_games_borads_status
-- ----------------------------
ALTER TABLE `ligs_games_borads_status` AUTO_INCREMENT=3;

-- ----------------------------
-- Auto increment value for ligs_games_status
-- ----------------------------
ALTER TABLE `ligs_games_status` AUTO_INCREMENT=5;

-- ----------------------------
-- Auto increment value for ligs_players
-- ----------------------------
ALTER TABLE `ligs_players` AUTO_INCREMENT=1;

-- ----------------------------
-- Auto increment value for ligs_status
-- ----------------------------
ALTER TABLE `ligs_status` AUTO_INCREMENT=5;

-- ----------------------------
-- Auto increment value for ligs_types
-- ----------------------------
ALTER TABLE `ligs_types` AUTO_INCREMENT=4;

-- ----------------------------
-- Auto increment value for provinces
-- ----------------------------
ALTER TABLE `provinces` AUTO_INCREMENT=32;

-- ----------------------------
-- Auto increment value for settings
-- ----------------------------
ALTER TABLE `settings` AUTO_INCREMENT=2;

-- ----------------------------
-- Auto increment value for users
-- ----------------------------
ALTER TABLE `users` AUTO_INCREMENT=2;

-- ----------------------------
-- Auto increment value for users_followers
-- ----------------------------
ALTER TABLE `users_followers` AUTO_INCREMENT=1;

-- ----------------------------
-- Auto increment value for users_groups
-- ----------------------------
ALTER TABLE `users_groups` AUTO_INCREMENT=5;

-- ----------------------------
-- Auto increment value for users_status
-- ----------------------------
ALTER TABLE `users_status` AUTO_INCREMENT=4;
